app/controllers/posts_controller.rb

SELECT * FROM "pages" WHERE (published_as = 'live')
SELECT * FROM "posts" WHERE ("posts".user_id = 1) ORDER BY created_at DESC, published_at desc LIMIT 10 OFFSET 0
SELECT count(posts.id) AS count_posts_id FROM "posts" WHERE ("posts".user_id = 1)
---
  def manage
    @posts = @user.posts.find_without_published_as(:all,
      :page => {:current => params[:page], :size => 10},
      :order => 'created_at DESC')

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "pages" WHERE (published_as = 'live')
SELECT * FROM "posts" WHERE ("posts".user_id = 1) AND (("posts".user_id = 1) AND (published_as = 'live')) ORDER BY published_at desc LIMIT 1 OFFSET 0
SELECT count(posts.id) AS count_posts_id FROM "posts" WHERE ("posts".user_id = 1) AND (("posts".user_id = 1) AND (published_as = 'live'))
---
  def index
    @user = User.find(params[:user_id])
    @category = Category.find_by_name(params[:category_name]) if params[:category_name]
    cond = Caboose::EZ::Condition.new
    if @category
      cond.append ['category_id = ?', @category.id]
    end

    @posts = @user.posts.recent.find :all, :conditions => cond.to_sql, :page => {:size => 10, :current => params[:page]}

SELECT * FROM "posts" WHERE ("posts"."pkey" IN ('px')) LIMIT 1
SELECT * FROM "users" WHERE ("users"."login" = 'anonymous') LIMIT 1
SELECT * FROM "comments" WHERE ("comments".commentable_id = 6 AND "comments".commentable_type = 'Post') ORDER BY created_at DESC LIMIT 20
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT DISTINCT posts.* FROM "posts" INNER JOIN taggings posts_taggings ON posts_taggings.taggable_id = posts.id AND posts_taggings.taggable_type = 'Post' INNER JOIN tags posts_tags ON posts_tags.id = posts_taggings.tag_id WHERE (posts.id != 21 AND published_as = 'live' AND (posts_tags.name LIKE 'computer' OR posts_tags.name LIKE 'dog')) AND (published_as = 'live') ORDER BY published_at DESC LIMIT 8
SELECT count(*) AS count_all FROM "posts" WHERE ("posts".user_id = 2)
---
  def pkey_show
    @post = Post.find_by_pkey(params[:pkey])
    if @post.nil?
      session[:user] ||= User.find_by_login("anonymous").id
      usr_login = current_user.login || User.find_by_login('anonymous').login
      redirect_to "/usr/#{usr_login}/posts/new?pkey=#{params[:pkey]}"
    else
      @user = @post.user

      @rss_title = "#{AppConfig.community_name}: #{@user.login}'s posts"
      @rss_url = user_posts_path(@user,:format => :rss)

      @is_current_user = @user.eql?(current_user)
      @comment = Comment.new(params[:comment])

      @comments = @post.comments.find(:all, :limit => 20, :order => 'created_at DESC', :include => :user)

      @previous = @post.previous_post
      @next = @post.next_post
      @popular_posts = @user.posts.find(:all, :limit => 10, :order => "view_count DESC")

SELECT * FROM "posts" WHERE ("posts".user_id = 1 AND (published_at < '2009-11-19 22:17:01' and published_as = 'live')) ORDER BY published_at DESC, published_at desc LIMIT 1
SELECT * FROM "comments" WHERE ("comments".commentable_id = 1 AND "comments".commentable_type = 'Post') ORDER BY created_at DESC LIMIT 20
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT DISTINCT posts.* FROM "posts" INNER JOIN taggings posts_taggings ON posts_taggings.taggable_id = posts.id AND posts_taggings.taggable_type = 'Post' INNER JOIN tags posts_tags ON posts_tags.id = posts_taggings.tag_id WHERE (posts.id != 21 AND published_as = 'live' AND (posts_tags.name LIKE 'computer' OR posts_tags.name LIKE 'dog')) AND (published_as = 'live') ORDER BY published_at DESC LIMIT 8
SELECT count(*) AS count_all FROM "posts" WHERE ("posts".user_id = 1)
---
  def show
    @rss_title = "#{AppConfig.community_name}: #{@user.login}'s posts"
    @rss_url = user_posts_path(@user,:format => :rss)

    @post = Post.find(params[:id])
    @user = @post.user
    @is_current_user = @user.eql?(current_user)
    @comment = Comment.new(params[:comment])

    @comments = @post.comments.find(:all, :limit => 20, :order => 'created_at DESC', :include => :user)

    @previous = @post.previous_post
    @next = @post.next_post
    @popular_posts = @user.posts.find(:all, :limit => 10, :order => "view_count DESC")

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def update_views
    @post = Post.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "posts" ("created_at", "post", "title", "updated_at", "emailed_count", "raw_post", "category_id", "user_id", "published_as", "contest_id", "favorited_count", "published_at", "view_count") VALUES('2009-11-19 22:17:01', '<p>I start counting at 100<img src="/photos/0000/0005/green_cucumber_medium.png" height="320" alt="created at: 2009-11-19" width="290" /></p>', 'blog post 100', '2009-11-19 22:17:01', 0, '<p>I start counting at 100<img src="/photos/0000/0005/green_cucumber_medium.png" border="0" alt="created at: 2009-11-19" width="290" height="320" /></p>', NULL, 1, 'live', NULL, 0, '2009-11-19 22:17:01', 0)
INSERT INTO "tags" ("name") VALUES('green')
INSERT INTO "choices" ("votes_count", "description", "poll_id") VALUES(0, 'dog', 1)
INSERT INTO "polls" ("created_at", "updated_at", "post_id", "votes_count", "question") VALUES('2009-11-21 10:51:37', '2009-11-21 10:51:37', 21, 0, 'dog or cat?')
---
  def create
    @user = User.find(params[:user_id])
    @post = Post.new(params[:post])
    @post.user = @user
    @post.tag_list = params[:tag_list] || ''

    respond_to do |format|
      if @post.save
        @post.create_poll(params[:poll], params[:choices]) if params[:poll]

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 29)
DELETE FROM "posts" WHERE "id" = 29
---
  def destroy
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])
    @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 14)
---
  def send_to_friend
    unless params[:emails]
      render :partial => 'posts/send_to_friend', :locals => {:user_id => params[:user_id], :post_id => params[:post_id]} and return
    end
    @post = Post.find(params[:id])

SELECT * FROM "posts" WHERE ((posts.published_at > '2009-11-16 22:15:39') AND (published_as = 'live')) ORDER BY posts.view_count DESC LIMIT 15
---
  def popular
    @posts = Post.find_popular({:limit => 15, :since => 3.days})

SELECT * FROM "pages" WHERE (published_as = 'live')
SELECT * FROM "posts" WHERE (published_as = 'live') ORDER BY posts.published_at DESC LIMIT 2 OFFSET 0
SELECT count(posts.id) AS count_posts_id FROM "posts" WHERE (published_as = 'live')
SELECT * FROM "clippings" WHERE (created_at > '2009-11-13 02:43:46') ORDER BY created_at DESC LIMIT 15
SELECT * FROM "photos" WHERE (photos.created_at > '2009-11-13 02:43:46' AND photos.parent_id IS NULL) ORDER BY photos.created_at DESC LIMIT 10
---
  def recent
    @posts = Post.recent.find :all, :page => {:current => params[:page], :size => 20}

    @recent_clippings = Clipping.find_recent(:limit => 15)
    @recent_photos = Photo.find_recent(:limit => 10)