app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."activation_code" = '9a20a68e7c27f40f310ae5ed97d9ed0de02a36f7') LIMIT 1
---
  def activate
    redirect_to signup_path and return if params[:id].blank?
    @user = User.find_by_activation_code(params[:id])

SELECT * FROM "pages" WHERE (published_as = 'live')
SELECT * FROM "users" WHERE ((activated_at IS NOT NULL ) AND (metro_area_id = '221')) ORDER BY users.created_at DESC LIMIT 1 OFFSET 0
SELECT count(DISTINCT users.id) AS count_users_id FROM "users" LEFT OUTER JOIN "taggings" ON ("users"."id" = "taggings"."taggable_id" AND "taggings"."taggable_type" = 'User') LEFT OUTER JOIN "tags" ON ("tags"."id" = "taggings"."tag_id") WHERE ((activated_at IS NOT NULL ) AND (metro_area_id = '221'))
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN users ON users.id = taggings.taggable_id WHERE (taggings.taggable_type = 'User') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0 LIMIT 10
---
  def index
    cond, @search, @metro_areas, @states = User.paginated_users_conditions_with_search(params)

    @users = User.recent.find(:all,
      :conditions => cond.to_sql,
      :include => [:tags],
      :page => {:current => params[:page], :size => 20}
      )

SELECT count(*) AS count_all FROM "friendships" WHERE ("friendships".user_id = 1 AND (initiator = 'f' AND friendship_status_id = 1))
SELECT * FROM "friendships" WHERE ("friendships".user_id = 1 AND (friendship_status_id = 2)) LIMIT 5
SELECT * FROM "comments" WHERE ("comments".commentable_id = 1 AND "comments".commentable_type = 'User') ORDER BY created_at DESC LIMIT 10
SELECT * FROM "photos" WHERE ("photos".user_id = 1) ORDER BY created_at desc LIMIT 5
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "posts" WHERE ("posts".user_id = 1) AND (published_as = 'live') ORDER BY published_at DESC, published_at desc LIMIT 2
SELECT * FROM "clippings" WHERE ("clippings".user_id = 1) ORDER BY created_at desc LIMIT 5
SELECT * FROM "activities" WHERE (activities.user_id in (1)) ORDER BY activities.created_at DESC LIMIT 10
---
  def show
    @friend_count               = @user.accepted_friendships.count
    @accepted_friendships       = @user.accepted_friendships.find(:all, :limit => 5).collect{|f| f.friend }
    @pending_friendships_count  = @user.pending_friendships.count()

    @comments       = @user.comments.find(:all, :limit => 10, :order => 'created_at DESC')
    @photo_comments = Comment.find_photo_comments_for(@user)
    @users_comments = Comment.find_comments_by_user(@user, :limit => 5)

    @recent_posts   = @user.posts.find(:all, :limit => 2, :order => "published_at DESC")
    @clippings      = @user.clippings.find(:all, :limit => 5)
    @photos         = @user.photos.find(:all, :limit => 5)
    @comment        = Comment.new(params[:comment])

    @my_activity = Activity.recent.by_users([@user.id]).find(:all, :limit => 10)

INSERT INTO "users" ("salt", "created_at", "activated_at", "notify_comments", "zip", "crypted_password", "remember_token_expires_at", "updated_at", "stylesheet", "login_slug", "activation_code", "country_id", "role_id", "avatar_id", "gender", "remember_token", "birthday", "activities_count", "description", "vendor", "notify_friend_requests", "featured_writer", "sb_posts_count", "sb_last_seen_at", "login", "state_id", "metro_area_id", "notify_community_news", "last_login_at", "profile_public", "email", "view_count") VALUES('5474a9d9c0ed85e9ba2cfe8b4b70e16e839c696d', '2009-11-19 22:11:32', NULL, 't', NULL, '08c6adde71b0f6c6c4f25678407f96a7ab3ab2ea', NULL, '2009-11-19 22:11:32', NULL, 'bob11', '9a20a68e7c27f40f310ae5ed97d9ed0de02a36f7', NULL, 3, NULL, NULL, NULL, '1984-11-19', 0, NULL, 'f', 't', 'f', 0, NULL, 'bob11', NULL, NULL, 't', NULL, 't', 'b@b.com', 0)
---
  def create
    @user       = User.new(params[:user])
    @user.role  = Role[:member]

    if (!AppConfig.require_captcha_on_signup || verify_recaptcha(@user)) && @user.save

SELECT * FROM "metro_areas" WHERE ("metro_areas"."id" = 221)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT count(*) AS count_all FROM "users" WHERE (metro_area_id = 221)
INSERT INTO "photos" ("name", "created_at", "size", "content_type", "album_id", "updated_at", "thumbnail", "user_id", "filename", "parent_id", "height", "description", "width", "view_count") VALUES(NULL, '2009-11-19 22:12:43', 2808, 'image/jpeg', NULL, '2009-11-19 22:12:43', NULL, 1, 'diver_dan.jpg', NULL, 135, NULL, 112, NULL)
UPDATE "metro_areas" SET "users_count" = 1 WHERE "id" = 221
UPDATE "users" SET "updated_at" = '2009-11-19 22:13:35', "state_id" = 5, "zip" = '94111', "metro_area_id" = 221, "country_id" = 208, "gender" = 'M', "description" = '<p>My name is bob</p>' WHERE "id" = 1
---
  def update
    @user.attributes      = params[:user]
    @metro_areas, @states = setup_locations_for(@user)

    unless params[:metro_area_id].blank?
      @user.metro_area  = MetroArea.find(params[:metro_area_id])
      @user.state       = (@user.metro_area && @user.metro_area.state) ? @user.metro_area.state : nil
      @user.country     = @user.metro_area.country if (@user.metro_area && @user.metro_area.country)
    else
      @user.metro_area = @user.state = @user.country = nil
    end

    @avatar       = Photo.new(params[:avatar])
    @avatar.user  = @user

    @user.avatar  = @avatar if @avatar.save

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
---
  def signup_completed
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def welcome_photo
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def welcome_about
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def welcome_invite
    @user = User.find(params[:id])

SELECT * FROM "countries" WHERE ("countries"."id" = 208)
SELECT * FROM "states" WHERE ("states"."id" = 5)
SELECT * FROM "metro_areas" WHERE ("metro_areas".state_id = 5) ORDER BY name
---
  def metro_area_update

    country = Country.find(params[:country_id]) unless params[:country_id].blank?
    state   = State.find(params[:state_id]) unless params[:state_id].blank?
    states  = country ? country.states.sort_by{|s| s.name} : []

    if states.any?
      metro_areas = state ? state.metro_areas.all(:order => "name") : []